print('เลือกเมนูเพื่อทำรายการ')
print('#####################')
print('กด 1 เลือกเหมาจ่าย')
print('กด 2 เลือกจ่ายเพิ่ม')

manu = int(input('เลือก'))

if manu == 1 :
    high =int(input('กรุณาเลือกระยะทาง'))
    if high <= 25 :
        print('ค่าใช้จ่ายรวม 25 บาท')#ระยะทางไม่เกิน 25 กิโลเมตร
    else :
        print('ค่าใช้จ่ายรวม 55 บาท')#ระยะทางเกิน 25 กิโลเมตร
elif manu == 2 :
    high=  int(input('กรุณากรอกระยะทาง : '))
    if high < 25 :
        print('ค่าใช้จ่ายรวม 25 บาท') #ระยะทางไม่เกิน 25 กิโลเมตร
    else :
        print('ค่าใช้จ่ายวม 55 บาท',int(25+55),'บาท') #ระยะทางเกิน 25 กิโลเมตร #แรกค่าเข้า + คิดเพิ่มเกิน 25กม.
